#include <stdio.h>

int main(void) 
{
  long long n;      //n值為輸入  count值為計數器
  int count= 1;     //count值從1開始  

  //輸出設定 
  while (scanf("%lld", &n) != EOF)
  {
      printf("%4d. ",count++);

    if(n==0)
    {
      printf("0");
    }  

    //14個0開始 _kuti
    if(n/100000000000000 != 0) //代表 大於14個0
    {
      printf("%lld kuti ", n/100000000000000);  //找出除14個0的商
      
      n = n%100000000000000;                    //把餘數賦值給n

      if (n < 10000000)                        //第一句完成，如果n值是大於7個0印kuti
      {
        printf("kuti ");
      }
      
    }                                           //14個0結束

    //12個0開始 _lakh
    if(n/1000000000000 != 0) //代表 大於12個0
    {
      printf("%lld lakh ", n/1000000000000);    //找出除12個0的商
      
      n = n%1000000000000;                      //把餘數賦值給n

      if (n < 10000000)                        //第一句完成，如果n值是大於7個0印kuti
      {
        printf("kuti ");
      }
      
    }                                           //12個0結束

    //10個0開始 _hajar
    if(n/10000000000 != 0) //代表 大於10個0
    {
      printf("%lld hajar ", n/10000000000);      //找出除10個0的商

      if (n < 10000000)                        //第一句完成，如果n值是大於7個0印kuti
      {
        printf("kuti ");
      }
      
      n = n%10000000000;                        //把餘數賦值給n
    }                                           //10個0結束  

    //9個0開始 _shata
    if(n/1000000000 != 0) //代表 大於9個0
    {
      printf("%lld shata ", n/1000000000);      //找出除9個0的商
      
      n = n%1000000000;                         //把餘數賦值給n

      if (n < 10000000)                        //第一句完成，如果n值是大於7個0印kuti
      {
        printf("kuti ");
      }
      
    }                                           //9個0結束   

    //7個0開始 _kuti
    if(n/10000000 != 0) //代表 大於7個0
    {
      printf("%lld kuti ", n/10000000);           //找出除7個0的商
      n = n%10000000;                             //把餘數賦值給n
    }                                           //7個0結束  
    
    //5個0開始 _lakh
    if(n/100000 != 0) //代表 大於5個0
    {
      printf("%lld lakh ", n/100000);           //找出除5個0的商
      n = n%100000;                             //把餘數賦值給n
    }                                           //5個0結束  

    //3個0開始 _hajar
    if(n/1000 != 0) //代表 大於3個0
    {
      printf("%lld hajar ", n/1000);            //找出除3個0的商
      n = n%1000;                               //把餘數賦值給n
    }                                           //3個0結束

    //2個0開始 _shata
    if(n/100 != 0) //代表 大於2個0
    {
      printf("%lld shata ", n/100);             //找出除2個0的商
      n = n%100;                                //把餘數賦值給n
      
    }                                           //2個0結束  

    if(n!= 0)
    {
    printf("%lld", n);                          //直接印出100內的數
    }                       

    printf("\n");
    
    }
      
    
  
  
  return 0;
}